[
  {
    "id": "superman",
    "colorLogoPath": "/superman-color-logo.svg",
    "enemies": [
      {
        "name": "Lex Luthor",
        "imagePath": "/lex-luthor-enemies.jpg",
        "description": "No Superman villain is as well known, or as well-loved as Lex Luthor. Often seen as the de facto leader of all of the DCU's supervillains"
      },
      {
        "name": "Darkseid",
        "imagePath": "/darkseid-enemies.jpg",
        "description": "The tyrannical ruler of Apokolips, a sadistic tyrant who has invaded and conquered countless worlds throughout the universe"
      },
      {
        "name": "Zod",
        "imagePath": "/zod-enemies.jpg",
        "description": "Once considered an outstanding military hero of the planet Krypton, Dru-Zod decided he would rather rule his world than serve it"
      },
      {
        "name": "Doomsday",
        "imagePath": "/doomsday-enemies.jpg",
        "description": "A weapon crafted in the most extreme conditions, Doomsday is an unstoppable force of destruction, devastation and death"
      },
      {
        "name": "Bizarro",
        "imagePath": "/bizarro-enemies.jpg",
        "description": "As result of a bizarre science experiment, Bizarro is an imperfect duplicate of Kal-El, with none of his intelligence or self-control"
      },
      {
        "name": "Brainiac",
        "imagePath": "/brainiac-enemies.jpg",
        "description": "One of the most intelligent beings in the entire universe, the wicked Brainiac's genius has challenged Superman over and over again"
      },
      {
        "name": "Parasite",
        "imagePath": "/parasite-enemies.jpg",
        "description": "Parasite feeds on energy to live and his touch allows him to sap the powers and memories of his victims, making him a formidable foe"
      },
      {
        "name": "Metallo",
        "imagePath": "/metallo-enemies.jpg",
        "description": "Metallo is more of an evil Tony Stark since his metallic body has all the technology needed to perform as well as the most gifted hero"
      }
    ]
  },
  {
    "id": "batman",
    "colorLogoPath": "/batman-color-logo.svg",
    "enemies": [
      {
        "name": "The Joker",
        "imagePath": "/joker-enemies.jpg",
        "description": "The Clown Prince of Crime is the authentic nemesis of Batman. His desire for chaos and carnage makes him a difficult villain to stop"
      },
      {
        "name": "Catwoman",
        "imagePath": "/catwoman-enemies.jpg",
        "description": "Selina Kyle is a good person who does bad things, making her both a sympathetic villain and an uneasy ally for the caped crusader"
      },
      {
        "name": "Two-face",
        "imagePath": "/two-face-enemies.jpg",
        "description": "Former district attorney, he became badly disfigured after a mob boss throws acid on his face. This fact turned him into Two-Face"
      },
      {
        "name": "The Penguin",
        "imagePath": "/penguin-enemies.jpg",
        "description": "Despite being the grotesque face of the city's criminal underworld, The Penguin has displayed intelligence and sophistication"
      },
      {
        "name": "The Riddler",
        "imagePath": "/riddler-enemies.jpg",
        "description": "At his best, this enigmatic evildoer is a riddling madman hellbent on pitting his amazing wits against the world's greatest detective"
      },
      {
        "name": "Bane",
        "imagePath": "/bane-enemies.jpg",
        "description": "After nearly dying from an experimental super-soldier program, this villain reached the pinnacle of physical and mental skills"
      },
      {
        "name": "Poison Ivy",
        "imagePath": "/poison-ivy-enemies.jpg",
        "description": "Poison Ivy is a lethal and beauty eco-terrorist who is obsessed with protecting the planet's plant life by eliminating all human life"
      },
      {
        "name": "Ras Al Ghul",
        "imagePath": "/ras-al-ghul-enemies.jpg",
        "description": "This super-intelligent, mystical international assassin leads the League of Assassins whose main purpose is purging the crimes of humanity"
      }
    ]
  },
  {
    "id": "wonderwoman",
    "colorLogoPath": "/wonderwoman-color-logo.svg",
    "enemies": [
      {
        "name": "Cheetah",
        "imagePath": "/cheetah-enemies.jpg",
        "description": "Cheetah may not only be the most famous of all of Wonder Woman's rogue gallery, but also the most lethal since she is the avatar of a god"
      },
      {
        "name": "Ares",
        "imagePath": "/ares-enemies.jpg",
        "description": "The Greek god of war is obviously a very dangerous foe. Ares is constantly lusting for more violence being extremely brutal in battle"
      },
      {
        "name": "Circe",
        "imagePath": "/circe-enemies.jpg",
        "description": "Based on the sorceress of Greek mythology, the Circe of the comics contains much of her mythological traits and powers"
      },
      {
        "name": "Veronica Cale",
        "imagePath": "/veronica-cale-enemies.jpg",
        "description": "A scientific genius and uber-rich (as owner of a pharmaceutical company). Cale is to Wonder Woman what Lex Luthor is to Superman"
      },
      {
        "name": "Doctor Psycho",
        "imagePath": "/doctor-psycho-enemies.jpg",
        "description": "This villain is sadistic and misogynistic. In some ways, he is the polar opposite of everything that Diana actually stands for"
      },
      {
        "name": "Silver Swan",
        "imagePath": "/silver-swan-enemies.jpg",
        "description": "From ugly duckling to murderous cyborg, Silver Swan might just have the most versatile resume of all of Wonder Woman’s enemies"
      },
      {
        "name": "Giganta",
        "imagePath": "/giganta-enemies.jpg",
        "description": "A scientist with a fatal blood disease that leads her to try and swap bodies with Diana. She has the power to grow to a huge height"
      },
      {
        "name": "Devastation",
        "imagePath": "/devastation-enemies.jpg",
        "description": "Her tragic nature combined with her powers being a dark echo of Diana's results in this foe being one of the more intriguing villains"
      }
    ]
  },
  {
    "id": "flash",
    "colorLogoPath": "/flash-color-logo.svg",
    "enemies": [
      {
        "name": "Reverse Flash",
        "imagePath": "/reverse-flash-enemies.jpg",
        "description": "As a dark mirror of the character, he traveled back in time and killed Flash's mother, which is what led Flash to become a hero"
      },
      {
        "name": "Grood",
        "imagePath": "/grood-enemies.jpg",
        "description": "Hailing from Gorilla City, a hidden society of highly evolved apes, Grodd has frequently tried to infiltrate and conquer man's world"
      },
      {
        "name": "Savitar",
        "imagePath": "/savitar-enemies.jpg",
        "description": "Named as the Hindu god-of-motion, Savitar was a pilot whose plane was suddenly struck by lightning, giving him super-speed"
      },
      {
        "name": "Captain Cold",
        "imagePath": "/captain-cold-enemies.jpg",
        "description": "This dangerous criminal is not a superpowered villain but instead uses weapons and tech that freezes everything around instantly"
      },
      {
        "name": "The Thinker",
        "imagePath": "/the-thinker-enemies.jpg",
        "description": "With a weaponized chair. The Thinker is the smartest villain on this list and is therefore one step ahead of the hero most of the times"
      },
      {
        "name": "Mirror Master",
        "imagePath": "/mirror-master-enemies.jpg",
        "description": "A lifelong criminal who became in a master of illusion, he makes use of his mirror gun to vex and addle the Scarlet Speedster at every turn"
      },
      {
        "name": "Heatwave",
        "imagePath": "/heatwave-enemies.jpg",
        "description": "A deadly villain who has committed countless crimes of arson and thieving. Even the fastest man alive can't run from the flames forever"
      },
      {
        "name": "Captain Boomerang",
        "imagePath": "/captain-boomerang-enemies.jpg",
        "description": "Because of his level of technology and skills with them, he is actually one of the most memorable people on the Flash's foes gallery"
      }
    ]
  },
  {
    "id": "greenlantern",
    "colorLogoPath": "/greenlantern-color-logo.svg",
    "enemies": [
      {
        "name": "Sinestro",
        "imagePath": "/sinestro-enemies.jpg",
        "description": "A former member of the Green Lantern Corps, Sinestro turns on the Guardians and dons a yellow ring, a ring powered by fear"
      },
      {
        "name": "Parallax",
        "imagePath": "/parallax-enemies.jpg",
        "description": "An evil space bug named Parallax who is the embodiment of all fear, it has gone on to possess numerous people across the universe"
      },
      {
        "name": "Nekron",
        "imagePath": "/nekron-enemies.jpg",
        "description": "Responsible for instigating the events of Blackest Night, Nekron led to the revival of millions of both, dead heroes and villains"
      },
      {
        "name": "Atrocitus",
        "imagePath": "/atrocitus-enemies.jpg",
        "description": "Survivor of a Manhunter attack. Enraged, Atrocitus gave birth to the Red Lantern Corps and wields his rage like a weapon"
      },
      {
        "name": "larfleeze",
        "imagePath": "/larfleeze-enemies.jpg",
        "description": "Larfleeze is the only member of the Orange Lantern Corps. With an immense amount of power, the agent orange is powered by avarice"
      },
      {
        "name": "Krona",
        "imagePath": "/krona-enemies.jpg",
        "description": "The resulting wave of cosmic power turned Krona into a being of pure energy who became a overly powerful cosmic-level entity"
      },
      {
        "name": "Hector Hammond",
        "imagePath": "/hector-hammond-enemies.jpg",
        "description": "Hector Hammond is a metahuman with a very large head whose telepathic abilities have constantly made him a foe to be reckoned with"
      },
      {
        "name": "Doctor Polaris",
        "imagePath": "/doctor-polaris-enemies.jpg",
        "description": "one minute appearing as Neal Emmerson and the next the dangerous Polaris who uses his powers to control magnetic fields"
      }
    ]
  },
  {
    "id": "aquaman",
    "colorLogoPath": "/aquaman-color-logo.svg",
    "enemies": [
      {
        "name": "Black Manta",
        "imagePath": "/black-manta-enemies.jpg",
        "description": "This villain is the main Aquaman's arch-nemesis. Consumed by his vendetta, he seeks the death of Arthur and the destruction of Atlantis"
      },
      {
        "name": "Ocean Master",
        "imagePath": "/ocean-master-enemies.jpg",
        "description": "The Ocean Master has seen himself as the true and unique king of Atlantis and has butted heads with Arthur on numerous occasions"
      },
      {
        "name": "Trench",
        "imagePath": "/trench-enemies.jpg",
        "description": "A former tribe of Atlantis that mutated to in the depths, the Trench is a huge menace which exists only to feed and kill anything it sees"
      },
      {
        "name": "Dead King",
        "imagePath": "/dead-king-enemies.jpg",
        "description": "Atlan is an ancient ruler of Atlantis who actually represents all of the worst elements of Atlantean culture. He is racist and elitist"
      },
      {
        "name": "Siren",
        "imagePath": "/siren-enemies.jpg",
        "description": "Considered to be one of the greatest female villains of Aquaman's rogue's gallery, Siren is the sister of Mera and sister-in-law to Arthur"
      },
      {
        "name": "Charybdis",
        "imagePath": "/charybdis-enemies.jpg",
        "description": "Driven mad when his wife and partner in crime Scylla was killed in an attempt to murder Aquaman, he became a major threat to the hero"
      },
      {
        "name": "Corum Rath",
        "imagePath": "/corum-rath-enemies.jpg",
        "description": "Leader of the eco-terrorist group known as the Deluge, Corum Rath became Atlantis king. This enemy forms a dark mirror to Aquaman"
      },
      {
        "name": "King Shark",
        "imagePath": "/king-shark-enemies.jpg",
        "description": "Mutant or son of a shark god? he is a super-villain and humanoid shark. Driven by animal instincts, he is unable to stop his need to feed"
      }
    ]
  },
  {
    "id": "cyborg",
    "colorLogoPath": "/cyborg-color-logo.svg",
    "enemies": [
      {
        "name": "Anomaly",
        "imagePath": "/anomaly-enemies.jpg",
        "description": "As a product of experimentation by Silas Stone, the father of Cyborg, he was created to replicate organic tissue to save Silas's wife"
      },
      {
        "name": "H8-Bit",
        "imagePath": "/h8-bit-enemies.jpg",
        "description": "He was a brilliant hacker before becoming in one of the unique villains due to his electricity powers and technology control"
      },
      {
        "name": "Shrapnel",
        "imagePath": "/shrapnel-enemies.jpg",
        "description": "This villain is a walking piece of organic metal with super-strength, endurance, and self-sustainability. An actual threat for any hero"
      },
      {
        "name": "Grid",
        "imagePath": "/grid-enemies.jpg",
        "description": "Grid is a malevolent sentient computer virus that lived within Cyborg’s. It's main goal is to feel the emotions of other living things"
      },
      {
        "name": "Magenta",
        "imagePath": "/magenta-enemies.jpg",
        "description": "With a mental illness that gave her a dissociative personality disorder, Magenta also owns powers related to magnetism"
      },
      {
        "name": "Cyborg Girl",
        "imagePath": "/cyborg-girl-enemies.jpg",
        "description": "Her aunt replaced her body with powerful cybernetic implants. Sadly, those upgrades are not used for the good of humanity at all"
      },
      {
        "name": "Bobby Zirrozinski",
        "imagePath": "/zirrozinski-enemies.jpg",
        "description": "A strong hatred for Cyborg, he is a military veteran who underwent a backdoor operation to add cybernetic attachments to his body"
      },
      {
        "name": "Gizmo",
        "imagePath": "/gizmo-enemies.jpg",
        "description": "This brainy enemy is a highly resourceful chap who is able to create a new machine with almost anything he has access to"
      }
    ]
  }
]